# Taps
tap 'beeftornado/rmtree'
tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'elastic/tap'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'mongodb/brew'

# GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Bash 4
brew 'bash'
brew 'bash-completion@2'

# Latest Vim (Apple ships outdated)
brew 'vim'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/zlib'

# Hombrew sugar
brew 'brew-cask-completion'

# Node
brew 'node'
brew 'nvm'
brew 'yarn'

# Python
brew 'pipx'
brew 'pyenv'
brew 'pyenv-virtualenv'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Go
brew 'go'

# Java - a necessary evil -- but at least now open & free
cask 'adoptopenjdk'

# Binaries
brew 'asciinema'
brew 'awscli'
brew 'awsebcli'
brew 'awslogs'
brew 'bfg'
brew 'elastic/tap/filebeat-full'
brew 'fzf'
brew 'ghi'
brew 'git'
brew 'git-lfs'
brew 'gron' # grep json
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'kubectx'
brew 'mackup'
brew 'mas'
brew 'openconnect'
brew 'openssl'
brew 'sass/sass/sass'
brew 'serverless'
brew 'thefuck'
brew 'tree'
brew 'wget'

# Manage login items from terminal
# https://github.com/OJFord/loginitems#loginitems
tap 'OJFord/formulae'
brew 'loginitems'

# DB
brew 'mongodb-community', restart_service: true
brew 'postgresql'
brew 'sqlite'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'appzapper'
cask 'audio-hijack'
cask 'backblaze'
cask 'bartender'
cask 'boom'
cask 'color-oracle'
cask 'couleurs'
cask 'crashplan'
cask 'daisydisk'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'fission'
cask 'fliqlo' # flip-clock screensaver
cask 'flux'
cask 'gitter'
cask 'google-chrome'
cask 'gpgtools'
cask 'hyper'
cask 'ibackupbot'
cask 'ifilex'
cask 'imageoptim'
cask 'insomnia' # rest client
cask 'insomnia-designer' # collaborative api design editor
cask 'kaleidoscope'
cask 'kap' # screen recorder
cask 'keybase'
cask 'little-snitch'
cask 'logitech-options'
cask 'mactracker'
cask 'mailplane'
cask 'masscode'
cask 'notion'
cask 'now'
cask 'nvalt'
cask 'omnigraffle'
cask 'origami-studio'
cask 'oversight'
cask 'postbox'
cask 'postman'
cask 'postico'
cask 'protonmail-bridge'
cask 'recordit'
cask 'rescuetime'
cask 'screens-connect'
cask 'sequel-pro'
cask 'simplenote'
cask 'sip'
cask 'sketch'
cask 'sketchpacks'
cask 'skype'
cask 'slack'
cask 'slimbatterymonitor' # old faithful -- alternative: 'coconutbattery'
cask 'soulver'
cask 'soundsource'
cask 'superduper'
cask 'tower'
cask 'transmit'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'zoomus'

# Fonts
cask 'font-fira-sans'
cask 'font-francois-one'
cask 'font-inter'
cask 'font-lato'
cask 'font-montserrat'
cask 'font-quattrocento'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-slab'
cask 'font-satisfy'

# -- icons
cask 'font-awesome-terminal-fonts'
cask 'font-fontawesome'
cask 'font-ionicons'
cask 'font-material-icons'
cask 'font-ubuntu'

# -- mono
cask 'font-anonymous-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-hasklig'
cask 'font-inconsolata'
cask 'font-input'
cask 'font-monoid'
cask 'font-monoisome'
cask 'font-open-sans'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Mac App Store
mas 'Backdrop', id: 411461952
mas 'Billings Pro', id: 434514810
mas 'Dato', id: 1470584107
mas 'Magnet', id: 441258766
mas 'Pixelmator Pro', id: 1289583905
mas 'ShotBox', id: 1278619270
mas 'SonicWeb', id: 660638272
mas 'Todoist', id: 585829637
mas 'Triode', id: 1450027401
