# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
# tap 'homebrew/apache'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
# tap 'homebrew/php'
# tap 'homebrew/services'

# GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Bash 4
brew 'bash'
brew 'bash-completion@2'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/zlib'

# Hombrew sugar
brew 'brew-cask-completion'

# Node
brew 'node'
brew 'nvm'
brew 'yarn'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Java - a necessary evil
cask 'java'

# Binaries
brew 'asciinema'
brew 'awscli'
brew 'bfg'
brew 'filebeat'
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'mackup'
brew 'mas'
brew 'openconnect'
brew 'thefuck'
brew 'tree'
brew 'wget'

# Manage login items from terminal
# https://github.com/OJFord/loginitems#loginitems
tap 'OJFord/formulae'
brew 'loginitems'

# Development
# brew 'apr'
# brew 'apr-util'
# brew 'openssl'
# brew 'sqlite'
# brew 'dnsmasq', restart_service: true
# brew 'mongodb', restart_service: true
# brew 'mysql', restart_service: true
# brew 'homebrew/apache/httpd22', args: ['with-mpm-event']
# brew 'homebrew/apache/mod_fastcgi', args: ['with-homebrew-httpd22']
# brew 'homebrew/apache/mod_wsgi', args: ['with-homebrew-httpd22', 'with-homebrew-python']
# brew 'homebrew/php/composer'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'appzapper'
cask 'atom'
cask 'bartender'
cask 'boom'
cask 'color-oracle'
cask 'couleurs'
cask 'daisydisk'
cask 'docker'
cask 'divvy'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'fliqlo' # flip-clock screensaver
cask 'flux'
cask 'gitter'
cask 'google-chrome'
cask 'gpgtools'
cask 'hyper'
cask 'ibackupbot'
cask 'imageoptim'
cask 'kaleidoscope'
cask 'keybase'
cask 'little-snitch'
cask 'logitech-options'
cask 'mactracker'
cask 'mailplane'
cask 'nvalt'
cask 'omnigraffle'
cask 'oversight'
cask 'postbox'
cask 'postman'
cask 'rescuetime'
# cask 'robomongo'
# cask 'sequel-pro'
cask 'simplenote'
cask 'sip'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'slimbatterymonitor' # old faithful -- alternative: 'coconutbattery'
cask 'soulver'
# cask 'sqlitebrowser'
# cask 'sublime-text' # atom or bust
cask 'superduper'
cask 'tower'
cask 'transmit'
cask 'tunnelbear'
cask 'zoomus'

# Fonts
cask 'font-awesome-terminal-fonts'
cask 'font-fira-sans'
cask 'font-fontawesome'
cask 'font-montserrat'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-slab'

# -- mono
cask 'font-anonymous-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-hasklig'
cask 'font-inconsolata'
cask 'font-input'
cask 'font-monoid'
cask 'font-monoisome'
cask 'font-open-sans'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Pixelmator', id: 407963104
mas 'Radium', id: 597611879
